      *    *************************************************************
      *
      *    Required loop variables for the bubble sort algorithm
      *
      *    *************************************************************

      *    Variables for Bubble sort
       01  I           PIC 9(4) VALUE 0.
       01  J           PIC 9(4) VALUE 0.
